# -*- coding: utf-8 -*-
'''
Λίστες Κώδικα για το "Βιβλίο της Python"
@author: Σαμαράς Νικόλαος - Τσιπλίδης Κωνσταντίνος
@date: 2019
Εκδόσεις Κριτική
'''
#ΛΙΣΤΑ ΚΩΔΙΚΑ 10-13. Η εντολή nonlocal 
x=100
def f1():
    x=99 # η x γίνεται νέα, τοπική μεταβλητή
    print('Πριν την εσωτερική κλήση',x)
    def f2():
        nonlocal x #η x κρατά την τιμή από την f1
        print('Εσωτερικά, πριν την αλλαγή',x)
        x=98 #αλλάζει τιμή και την μεταφέρει πίσω στην f1
        print('Το x μετά την εσωτερική αλλαγή',x)

    f2()
    print('Μετά την κλήση της εσωτερικής συνάρτησης',x)

f1()
print('Κύριο πρόγραμμα',x)
