# -*- coding: utf-8 -*-
'''
Λίστες Κώδικα για το "Βιβλίο της Python"
@author: Σαμαράς Νικόλαος - Τσιπλίδης Κωνσταντίνος
@date: 2019
Εκδόσεις Κριτική
'''
#ΛΙΣΤΑ ΚΩΔΙΚΑ 10-21. Χρήση παραμέτρων – αντιμετάθεση 
def swap(x,y):
    return y,x

a,b=1,2
print('Αρχικές τιμές','a=',a,'b=',b)
a,b=swap(a,b)
print('Τελικές τιμές','a=',a,'b=',b)
k,n=True,False
print('Αρχικές τιμές','k=',k,'n=',n)
k,n=swap(k,n)
print('Τελικές τιμές','k=',k,'n=',n)
t1,t2=(1,2,3),(3,2,1)
print('Αρχικές τιμές','t1=',t1,'t2=',t2)
t1,t2=swap(t1,t2)
print('Τελικές τιμές','t1=',t1,'t2=',t2)
