# -*- coding: utf-8 -*-
'''
Λίστες Κώδικα για το "Βιβλίο της Python"
@author: Σαμαράς Νικόλαος - Τσιπλίδης Κωνσταντίνος
@date: 2019
Εκδόσεις Κριτική
'''
#ΛΙΣΤΑ ΚΩΔΙΚΑ 4-18. while – έλεγχος εγκυρότητας 
while True:
    try:
        x=int(input('Δώσε έναν ακέραιο:'))
    except ValueError:
        print('Ο αριθμός που έδωσες δεν είναι ακέραιος')
        print('Ξαναπροσπαθησε')
    else:
        if x>0:
            break
        print('Δώσε μόνο θετικό.Ξαναπροσπάθησε')
print('Τέλος εισαγωγής δεδομένων. Ευχαριστώ')
