# -*- coding: utf-8 -*-
'''
Λίστες Κώδικα για το "Βιβλίο της Python"
@author: Σαμαράς Νικόλαος - Τσιπλίδης Κωνσταντίνος
@date: 2019
Εκδόσεις Κριτική
'''
#Λίστα Κώδικα 6-1. Δημιουργία string 
s="python"
type(s)  
print('"Καλημέρα", είπε η Αλίκη')  
print('\"Καλημέρα\", είπε η Αλίκη'  
comment='''μπορεί να δοθεί κείμενο  
... πολλαπλές γραμμές''' 
hello= """ "Καλημέρα σε όλους", απάντησε η Άννα""" 
print(hello)   
hello= " "Καλημέρα σε όλους", απάντησε η Άννα"
l=list('python')   
l 
l.append(s) #που προσθέτει το s στη λίστα l   
l   
a=['αβ', 'βα']   
a
