# -*- coding: utf-8 -*-
'''
Λίστες Κώδικα για το "Βιβλίο της Python"
@author: Σαμαράς Νικόλαος - Τσιπλίδης Κωνσταντίνος
@date: 2019
Εκδόσεις Κριτική
'''
#Λίστα Κώδικα 2-8. Τύπος decimal 
Decimal(1)#Δημιουργία Decimal από ακέραιο 
Decimal(1/3)#… αλλά και με πράξη με την μέγιστη ακρίβεια
Decimal(1)/Decimal(3)  #πράξη με Decimals με ακρίβεια 28    ψηφίων
Decimal('0.2')  #… αλλά και ενός πραγματικού από κείμενο
Decimal('1/3')  #πράξη σε κείμενο δεν επιτρέπεται
Decimal()  #το κενό επιστρέφει 0
Decimal(2)+5  #πράξεις με ακέραιους γίνονται, 
Decimal(2.1)+5  #Το Decimal μπορεί να είναι πραγματικός
Decimal('2.1')+5  #… ή και αριθμός ως κείμενο
Decimal(2.1)+5.1#… πράξη με float δεν γίνεται
Decimal(0.1)*Decimal(0.5)  
Decimal('0.1')*Decimal('0.5')  
