# -*- coding: utf-8 -*-
'''
Λίστες Κώδικα για το "Βιβλίο της Python"
@author: Σαμαράς Νικόλαος - Τσιπλίδης Κωνσταντίνος
@date: 2019
Εκδόσεις Κριτική
'''
#Λίστα Κώδικα 2-1. Αριθμητικές πράξεις 
1+2.0 #γίνεται μετατροπή σε πραγματικό αριθμό 
1-3  
3/4*5  
6/2*3  #προσοχή στην προτεραιότητα των πράξεων
2/2  #η διαίρεση ακεραίων αποδίδει πραγματικό πηλίκο(!) 
6/2  
(1+2+3)/3  #ο μέσος όρος των 1, 2 και 3
1+2+3/3  
2**16  #το 216
7/3  
7//3  
7%3  
6/3#η πραγματική διαίρεση αποδίδει πραγματικό αριθμό
-7//3  #Ιδιαίτερη περίπτωση είναι οι αρνητικοί ακέραιοι
-7%3  
6%3  
1/10  
0.1+0.1+0.1-0.3    #ενώ θα έπρεπε να δίνει 0, τελικά δίνει
