# -*- coding: utf-8 -*-
'''
Λίστες Κώδικα για το "Βιβλίο της Python"
@author: Σαμαράς Νικόλαος - Τσιπλίδης Κωνσταντίνος
@date: 2019
Εκδόσεις Κριτική
'''
#Λίστα Κώδικα 2-10. Decimal: ειδικές περιπτώσεις 
getcontext().clear_traps()#'χειροκίνητος' καθαρισμός traps
Decimal(2)/0  #η διαίρεση με το 0 γίνεται κανονικά
Decimal(-2)/0  #το πρόσημο μπορεί να αλλάξει
a=Decimal(-2)/0#η μεταβλητή a είναι τύπου Decimal με τιμή -∞
a
a*-1  #το μόνο που μπορεί να αλλάξει είναι το πρόσημο
a/2 #προσοχή: κάθε πράξη με το a θα δημιουργεί τιμές= ±∞
2/a  #μια ειδική περίπτωση με…
a/a  #η περίπτωση όπου το αποτέλεσμα δεν είναι αριθμός
a-a  #και η διαφορά τους 
