# -*- coding: utf-8 -*-
'''
Λίστες Κώδικα για το "Βιβλίο της Python"
@author: Σαμαράς Νικόλαος - Τσιπλίδης Κωνσταντίνος
@date: 2019
Εκδόσεις Κριτική
'''
#Λίστα Κώδικα 2-5. Βιβλιοθήκη math 
math.ceil(12.2)# Στρογγυλοποίηση προς τα 'επάνω'
math.ceil(-12.7)  # Στρογγυλοποίηση και για αρνητικούς
math.factorial(5)# Υπολογίζει το παραγοντικό ενός αριθμού 
math.floor(6.7)# Στρογγυλοποίηση προς τα 'κάτω'
math.floor(-6.2)# …και για αρνητικούς αριθμούς
math.trunc(12.23)# Αποκοπή δεκαδικών
math.modf(12.5)# Δημιουργία ζεύγους τιμών (πλειάδα)
math.exp(2)# Υπολογίζει το ex
math.log(100)# Υπολογίζει τον φυσικό λογάριθμο
math.log(100,10)# Υπολογίζει τον λογάριθμο με βάση το 10
math.log(100,2)# Υπολογίζει τον λογάριθμο με βάση το 2
math.log2(100)# Υπολογίζει τον λογάριθμο με βάση το 2
math.log10(100)# Υπολογίζει τον λογάριθμο με βάση το 10
math.pow(2,4)# Δυνάμεις: 24
math.hypot(2,3)# Υπολογισμός της υποτείνουσας ορθ. τριγώνου
math.cos(45)# Υπολογισμός συνημίτονου γωνίας
math.sin(45)# Υπολογισμός ημίτονου γωνίας
math.tan(45)# Υπολογισμός εφαπτομένης γωνίας
math.degrees(math.pi)# Μετατροπή ακτινίων σε μοίρες
math.radians(180)# Μετατροπή μοιρών σε ακτίνια
math.gamma(5)# Επιστρέφει το (n-1)!
math.pi# Η γνωστή σταθερά
math.e# Σταθερή τιμή του e
math.inf# Τιμή infinity (άπειρο)
math.isinf(12)# Έλεγχος ύπαρξης άπειρου
math.isfinite(0)# Έλεγχος για πραγματική – πεπερασμένη τιμή
math.gcd(6,8)# Μέγιστος κοινός διαιρέτης
math.tau# Η σταθερά t=2π
sum([1.23e16,1,-1.23e16])# Ενώ η ενσωματωμένη συνάρτηση sum() έχει πρόβλημα με τιμές πολύ ακραίες, εδώ το 1 εξαφανίζεται ως δια μαγείας,… 
math.fsum([1.23e16,1,-1.23e16])# … η fsum() παρέχει μεγαλύτερη ακρίβεια 
