# -*- coding: utf-8 -*-
'''
Λίστες Κώδικα για το "Βιβλίο της Python"
@author: Σαμαράς Νικόλαος - Τσιπλίδης Κωνσταντίνος
@date: 2019
Εκδόσεις Κριτική
'''
#Λίστα Κώδικα 2-19. Παράδειγμα 2-4 
# -*- coding: utf-8 -*-
""" Υπολογισμός ΦΠΑ 
    αρχείο px4.py"""  
# Εισαγωγή από το πληκτρολόγιο της τιμής και μετατροπή σε πραγματικό αριθμό 
poso=float(input("Δώσε την τιμή:"))  
# Υπολογισμός του ΦΠΑ 
fpa=poso*0.24 # ή: fpa=poso*24/100
# Υπολογισμός του τελικού ποσού 
tp=poso+poso*0.24  # ή: tp=poso*1.24  ή: tp=poso+fpa
# Εμφάνιση των αποτελεσμάτων στην οθόνη 
print('ΦΠΑ:', fpa, 'Τελικό Ποσό:', tp)
