# -*- coding: utf-8 -*-
'''
Λίστες Κώδικα για το "Βιβλίο της Python"
@author: Σαμαράς Νικόλαος - Τσιπλίδης Κωνσταντίνος
@date: 2019
Εκδόσεις Κριτική
'''
#Λίστα Κώδικα 2-3. Μεικτοί υπολογισμοί 
132+32#Άθροισμα ακεραίων αποδίδει ακέραιο αποτέλεσμα
12-13  #Το ίδιο και η αφαίρεση
1.3+2.2 #Όταν και οι δύο αριθμοί πραγματικοί…
2.5+1#ή όταν ο ένας από τους δύο είναι πραγματικός…
2*3#Το γινόμενο ακολουθεί επίσης τον προηγούμενο τρόπο…
2.3*(-2)#ανεξάρτητα από το πρόσημο που έχει
6/3#Ωστόσο, στην διαίρεση το αποτέλεσμα μετατρέπεται… 
6//3#Αν το αποτέλεσμα πρέπει να είναι ακέραιος 
