# -*- coding: utf-8 -*-
'''
Λίστες Κώδικα για το "Βιβλίο της Python"
@author: Σαμαράς Νικόλαος - Τσιπλίδης Κωνσταντίνος
@date: 2019
Εκδόσεις Κριτική
'''
#Λίστα Κώδικα 2-6. Βιβλιοθήκη random 
random.seed(5)#Αρχικοποίηση δημιουργίας τυχαίων αριθμών
 
random.random()#Δημιουργία 1ου τυχαίου αριθμού
random.random()#Δημιουργία 2ου τυχαίου αριθμού 
random.random()#Δημιουργία 3ου τυχαίου αριθμού
random.seed(5)#Αρχικοποίηση ξανά. Μετά την νεότερη 
random.random()# είναι οι ίδιοι με τους προηγούμενους
random.random()   
random.random()
