# -*- coding: utf-8 -*-
'''
Λίστες Κώδικα για το "Βιβλίο της Python"
@author: Σαμαράς Νικόλαος - Τσιπλίδης Κωνσταντίνος
@date: 2019
Εκδόσεις Κριτική
'''
#Λίστα Κώδικα 2-13. Μορφοποίηση υπολοίπου (%) 
print('%d'%12)#αν το στοιχείο που θα εκτυπωθεί είναι ένα…  
print('%d'%12.6)  #μπορεί να γίνει και έμμεσα μετατροπή
print('%d %o'%(19,19))  #τυπώνεται ο ακέραιος 19 και …
print('%f %x'%(19,19))#ο 19 μετατρέπεται σε float (f) και …
print('%s %c'%(144,955))#το 144 τυπώνεται ως κείμενο μαζί 
print('%c %c'%(177,0x1f26))  # τυπώνεται ο ASCII χαρακτή ρας με κωδικό 177
print('%E %e'%(1234.5678,0.00012367))#αριθμοί σε επιστημο- νική μορφή
print('Απλά το σύμβολο %%!')  #εμφάνιση του συμβόλου '%'
