# -*- coding: utf-8 -*-
'''
Λίστες Κώδικα για το "Βιβλίο της Python"
@author: Σαμαράς Νικόλαος - Τσιπλίδης Κωνσταντίνος
@date: 2019
Εκδόσεις Κριτική
'''
#Λίστα Κώδικα 2-14. Μορφοποίηση υπολοίπου – σημαίες 
print('%+d'%19)#εμφανίζεται και το πρόσημο  
print('%+d'%-19)#μπορεί να γίνει και έμμεσα μετατροπή
print('% d'%19)#προηγείται ένα κενό πριν τον θετικό αριθμό…
print('% d'%-19)#ώστε να γίνει η στοίχιση μετά το πρόσημο
print('%-18.3f$'%(-19.1234))#η στοίχιση γίνεται αριστερά
print('%18.3f$'%(-19.1234))#ενώ κανονικά είναι δεξιά
