# -*- coding: utf-8 -*-
'''
Λίστες Κώδικα για το "Βιβλίο της Python"
@author: Σαμαράς Νικόλαος - Τσιπλίδης Κωνσταντίνος
@date: 2019
Εκδόσεις Κριτική
'''
#Λίστα Κώδικα 2-4. Ενσωματωμένες συναρτήσεις 
abs(-12)# Η απόλυτη τιμή ενός ακεραίου
abs(-123.23)  # … αλλά και ενός πραγματικού
bin(8)  # μετατροπή ακέραιου από το δεκαδικό 
bin(-12345)# το ίδιο και οι αρνητικοί
bool()# Μετατροπή στοιχείων σε λογικές τιμές
bool(0)# Τα στοιχεία: 0, None, ‘’, (), [] ή {} επιστρέφουν
bool(2345)# Όλα τα μη κενά στοιχεία έχουν την τιμή True
complex(2,5)# Κατασκευή ενός μιγαδικού αριθμού:
divmod(7,2)# Δύο σε μια λειτουργία αντί των // και %
hex(286)# Ο δεκαεξαδικός αντίστοιχος ενός ακεραίου
max(1,2,3,1.4,5,2)# Εύρεση του μεγαλύτερου από μια λίστα
min(1,2,3,1.4,5,2)# … ή και του μικρότερου
sum([1,2,3,4,5])# Υπολογίζει το άθροισμα αριθμών 
oct(2345)# Ο οκταδικός αριθμός ενός ακεραίου
ord('b')# Αποδίδει τον δεκαδικό κωδικό αριθμό του πίνακα…
chr(940)# Δίνοντας έναν αριθμό επιστρέφει τον αντίστοιχο…
pow(2,4)# Υπολογίζει τη δύναμη 2^4
round(123.456)# Κάνει στρογγυλοποιήσεις αριθμών
round(123.456, 2)# Στα πρώτα δύο δεκαδικά
round(123.436, 1)# Με ένα δεκαδικό
round(123.456, -2)# Αν είναι αρνητικό το δεύτερο όρισμα η… 
round(123.456, -1)# Εδώ στις δεκάδες 
