#include <stdio.h>
#include <stdlib.h>
#include <time.h>

void make_rand(double *p);

int main(void)
{
	double d;

	make_rand(&d);
	printf("%.2f\n", d);
	return 0;
}

void make_rand(double *p)
{
	int i;

	srand(time(NULL)); /* Υπενθυμίζεται ότι η srand() σε συνδυασμό με την time() χρησιμοποιείται για τη δημιουργία τυχαίων θετικών ακεραίων κάθε φορά που εκτελείται το πρόγραμμα. */
	i = rand() % 101; /* Η rand() επιστρέφει έναν τυχαίο θετικό ακέραιο, ο οποίος περιορίζεται στο [0, 100]. */
	*p = i / 100.0; /* Η διαίρεση με το 100.0 δημιουργεί έναν τυχαίο πραγματικό αριθμό με τιμή στο [0, 1] και μάλιστα με δύο δεκαδικά ψηφία. */
}