# -*- coding: utf-8 -*-
'''
Λίστες Κώδικα για το "Βιβλίο της Python"
@author: Σαμαράς Νικόλαος - Τσιπλίδης Κωνσταντίνος
@date: 2019
Εκδόσεις Κριτική
'''
#ΛΙΣΤΑ ΚΩΔΙΚΑ 5-6. Παραδείγματα κατάτμησης 
k=list(range(10))#η range θα δημιουργησει μια ακολουθια
k#από το 0 μέχρι το 9 και η list θα δημιουργήσει νέα λίστα
k[1] #το 2ο στοιχείο της λίστας 
k[1:3] #το τμήμα λίστας από το στοιχείο της θέσης 1 μέχρι
k[2:7:2]#από το 3ο (θέση 2) μέχρι και το 7ο στοιχείο 
k[:5:3] #από την αρχή έως και το στοιχείο της θέσης 4, ανά 3
k[::4] #ανά 4 από την αρχή έως το τέλος
k[5:3] #προσοχή σε τέτοιες περιπτώσεις
k[3:5:-1] #όπως και εδώ
k[5:3:-1]#αν ο δείκτης 3 είναι αρνητικός, η σάρωση γίνεται
k[-2:-4:-1] #από το 2ο από το τέλος στοιχείο μέχρι και το 
k[-2:-6:-1]#από το 2ο από το τέλος στοιχείο μέχρι και το
k[::]#ολόκληρη η λίστα
k[::-1]# ολόκληρη η λίστα αλλά με αντίθετη φορά
