# -*- coding: utf-8 -*-
'''
Λίστες Κώδικα για το "Βιβλίο της Python"
@author: Σαμαράς Νικόλαος - Τσιπλίδης Κωνσταντίνος
@date: 2019
Εκδόσεις Κριτική
'''
#ΛΙΣΤΑ ΚΩΔΙΚΑ 3-19. Εμφωλευμένη if – χρέωση κούριερ 
we=int(input('Δώσε το βαρος:')) 
tr=int(input('Τρόπος αποστολής (0:κανονικο,1:express):'))
if tr: #ή tr==1
    if we<=1000:
        x=5
    elif we<=2000:
        x=7
    elif we<=4000:
        x=9
    elif we<=2000: #ή else:
        x=12
else:
    if we<=1000:
        x=3
    elif we<=2000:
        x=4
    elif we<=4000:
        x=5
    elif we<=2000: #ή else:
        x=8
print('Έξοδα αποστολής:',x)
