#include <stdio.h>
#include <stdlib.h>
#include <time.h>

#define ROWS 5

int main(void)
{
	int i, j, determ, arr[ROWS][ROWS];

	determ = 1; /* Αρχικοποίηση της ορίζουσας του πίνακα. */
	srand(time(NULL));
	for (i = 0; i < ROWS; i++)
	{
		for (j = 0; j < ROWS; j++)
		{
			if (i > j)
				arr[i][j] = 0; /* Στον άνω τριγωνικό πίνακα, τα στοιχεία κάτω από την κύρια διαγώνιο είναι μηδέν. */
			else
				arr[i][j] = rand() % 7 - 3; /* Το αποτέλεσμα rand()%7 είναι ένας ακέραιος στο [0, 6]. Αφαιρώντας 3, ο ακέραιος που προκύπτει ανήκει στο [-3, 3]. */
			printf("%3d", arr[i][j]);
			if (i == j) /* Ελέγχουμε αν το στοιχείο βρίσκεται στην κύρια διαγώνιο. */
				determ *= arr[i][j]; /* Η ορίζουσα ενός τριγωνικού πίνακα ισούται με το γινόμενο των στοιχείων της κύριας διαγωνίου του. */
		}
		printf("\n"); /* Χρησιμοποιείται για τη δημιουργία των διαφορετικών γραμμών του πίνακα. */
	}
	printf("\nThe determinant is: %d\n", determ);
	return 0;
}